Repository: Patricia370/Health-Bits-Project-1
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: es

source: (Continued from first page)
es: (viene de la página anterior)

source: (Continued on next page)
es: (continúa en la página siguiente)

source: 4 • Issue 9
es: 4 • Número 9

source: A deli luncheon will be served.
es: Se servirá un almuerzo de degustación.

source: A repetitive strain injury (RSI) is an injury or disorder of the joints, nerves, muscles, ligaments or tendons.
es: Una lesión oseomuscular (LOM) es una lesión o afección de las articulaciones, nervios, músculos, ligamentos o tendones.

source: Another type of health-related condition due to computer use is computer vision syndrome (CVS).
es: Otro tipo de llesión relacionada con el uso del ordenador es el síndrome informático de visión (SIV).

source: Beginning May 1, Health Bits Group members are entitled to a 10 percent discount on regular price products at these stores: Office Warehouse, Simply Nutrition, and The Sports Center.
es: A partir del 1 de mayo, los miembros del grupo Health Bits tendrán derecho a un 10% de descuento en los productos de precio normal en las siguientes tiendas: Office Warehouse, Simply Nutrition y The Sports Center.

source: CVS is not believed to have serious or long-term consequences.
es: No se cree que el SIV tenga consecuencias serias a largo plazo.

source: Carpal tunnel syndrome (CTS) is inflammation of the nerve that connects the forearm to the palm of the hand.
es: El síndrome del túnel carpiano (STC) es una inflamación del nervio que conecta el antebrazo con la palma de la mano.

source: Common symptoms linked to tendonitis of the wrist include extreme pain that extends from the forearm to the hand, along with a tingling feeling in the fingers.
es: Entre los síntomas habituales dela tendinitis de muñeca se cuentan un dolor agudo que se extiende del antebrazo a la mano y hormigueo en los dedos.

source: Computer users should be proactive and minimize their chance of health complications.
es: Los usuarios de ordenadores deberían ser proactivos y minimizar sus posibilidades de sufrir complicaciones de salud.

source: Computer-related RSIs include tendonitis and carpal tunnel syndrome.
es: Estas LOM incluyen la tendinitis y el síndrome del túnel carpiano.

source: Ergonomics is an applied science devoted to including comfort, efficiency, and safety in the design of the workplace.
es: La ergonomía es una ciencia aplicada que se dedica a buscar el confort, la eficiencia y la seguridad en el diseño de los lugares de trabajo.

source: Finally, minimize the number of times you switch between the mouse and the keyboard, and avoid using the heel of your hand as a pivot point while typing or using the mouse.
es: Por último, minimiza el número de veces que cambias del ratón altteclado, y evita apoyarte en la base de la mano al girarla mientras escribes o usas el ratón.

source: For the computer area, experts recommend a workspace of at least two feet by four feet.
es: Para la zona del ordenador, los expertos recomiendas un espacio de trabajo de al menos 40x80 cm..

source: GROUP MEETING
es: REUNIÓN DEL GRUPO

source: Health Concerns Related to Computer Use
es: Problemas de salud relacionados con el uso del ordenador

source: If untreated, these disorders can lead to permanent damage to your body.
es: Si no se tratan,e stas lesiones pueden provocar daños permanentes.

source: In this position, your wrist is flat on the desk.
es: En esa posición, la muñeca está en horizontal sobre el escritorio.

source: Long-term computer work can lead to tendonitis or CTS.
es: A largo plazo el uso del ordenador puede causar tendinitis o STC.

source: MEMBER DISCOUNTS
es: DESCUENTOS PARA MIEMBROS

source: Monthly Newsletter
es: Boletín mensual

source: NEXT ISSUE
es: Próximo número

source: Next month’s issue of Health Bits will discuss hay fever and other pollen-related allergies.
es: En el número del mes que viene de Health Bits hablaremos sobre la fiebre del heno y otras alegrias relacionadas con el polen.

source: OSHA (Occupational Safety and Health Administration) has guidelines designed to minimize or prevent workplace injuries with respect to computer usage.
es: La ASST (Administración para la Salud y la Seguridad en el Trabajo) ofrece consejos diseñados para minimizar prevenir las lesiones en los lugares de trabajo relacionadas con el uso de ordenadores.

source: One way to help prevent these injuries is to be sure the workplace is designed ergonomically.
es: Una forma de ayudar a prevenir estas lesiones es asegurarse de que el lugar de trabajo esté diseñado de forma ergonómica.

source: People who spend entire days using a computer sometimes complain of lower back pain and muscle fatigue.
es: La gente que pasa días enteros utilizando un ordenador en ocasiones se queja de dolor en la parte baja de la espalda y fatiga muscular.

source: RSIs are the largest job related injury and illness problem in the U.S.
es: Las LOM son la principal lesión relacionada con el trabajo en los EEUU

source: RSIs are the largest job-related injury and illness problem in the U.S.
es: Las LOM son la principal lesión relacionada con el trabajo en los EEUU.

source: Repeated and/or forceful bending of the wrist can cause tendonitis or CTS.
es: El movimiento repetido o forzado de la muñeca puede causar tendinitis o STC.

source: Some symptoms of CTS include numbness and tingling in the thumb and first two fingers, and a burning pain when the nerve is compressed.
es: Algunos síntomas de STC incluyen falta de sensibilidad y hormigueo en el pulgar y los dos primeros dedos, y un dolor intenso cuando se presiona el nervio.

source: Studies have shown that using the correct configuration and type of chair, keyboard, display device, and work surface helps users work comfortably and efficiently and helps protect their health.
es: Hay estudios que demuestran que utilizar la configuración y tipo de silla, teclado, pantalla y superficie de trabajo correctos ayuda a los usuarios a trabajar de forma cómoda y eficiente y ayuda a proteger su salud.

source: T
es: E

source: Take frequent breaks to exercise your hands.
es: Haz descansos frecuentes para ejercitar las manos.

source: Tendonitis is inflammation of a tendon due to repeated motion or stress on that tendon.
es: La tendinitis es una inflamación de un tendón debido a un movimiento repetido o presión sobre el mismo.

source: The back pain sometimes is caused from poor posture.
es: El dolor de espalda en ocasiones es consecuencia de una mala postura.

source: The guest speaker, Sean Riverton, will discuss how to keep our environment healthy.
es: El orador invitado, Sean Riverton, hablará sobre como podemos mantener un ambiente saludable a nuestro alrededor.

source: The next meeting of the Health Bits Group will be held on Saturday, May 17, at the Glenview Recreation Center (440 Cedar Street) from 11:30 a.m. to 3:00 p.m.
es: La próxima reunión del grupo Health Bits se celebrará el domingo, 17 de marzo en el centro recreativo Glenview de 11:30 a 15.

source: This article discusses computer health risks and preventions.
es: En este artículo se tratan los riesgos de salud relacionados con el ordenador y cómo prevenirlos.

source: To prevent injury due to typing, place a wrist rest between the keyboard and the edge of your desk.
es: Para evitar lesiones por el uso del teclado, coloca un apoyo para la muñeca entre el teclado y el borde de la mesa.

source: To prevent injury while using a mouse, place the mouse at least six inches from
es: Para evitar lesiones por el uso del ratón, colocalo a al menos quince centímetros

source: To receive the discount, show your Health Bits Group membership card at the time of purchase.
es: Para recibir el descuento, muestre su tarjeta del grupo Health Bits al realizar su compra.

source: You can take many precautions to prevent these types of injuries.
es: Se pueden tomar muchas precauciones para evitar este tipo de lesiones.

source: You may have CVS if you have sore, tired, burning, itching, or dry eyes; headache or sore neck; blurred or double vision; increased sensitivity to light; and difficulty focusing.
es: Puede que sufras SIV si tienes los ojos secos, cansados o te pican; si sufres dolores de cabeza o de cuello, visión borrosa o doble, sensibilidad excesiva a la luz, y tienes dificultades para concentrarte.

source: he widespread use of computers has been causing health concerns.
es: l uso generalizado de los ordenadores ha causado preocupaciones sobre la salud.

source: the edge of the desk.
es: del borde de la mesa.

source: today.
es: hoy en día.
